//
// Created by icekylin on 4/23/22.
//

//#include <stdio.h>

/*
 * # 字面量（常量）
 *
 * ## 整数字面量
 *
 * - 整数字面量可以是 10 进制、8 进制或 16 进制的字面量
 * - 前缀指定基数
 *   - `0x` 表示 16 进制
 *   - `0` 表示 8 进制
 *   - 不带前缀默认表示 10 进制
 * - 整型字面量可以带 `u` 或 `l` 组合的后缀
 *   - `u` 表示无符号整数
 *   - `l` 表示长整数
 *
 * ## 浮点字面量
 *
 * - 浮点字面量由整数部分、小数点、小数部分和指数部分组成
 * - 可以使用小数形式或指数形式来表示浮点字面量
 * - 带 `f` 后缀表示 float 类型字面量
 *
 * ## 字符字面量
 *
 * - 字符字面量是括在单引号中的一个普通字符或一个转义字符
 *
 * ## 字符串字面量
 *
 * - 字符串字面量是括在双引号中的字符序列
 */

//int main() {
//    int i1 = 0xff;
//    int i2 = 0233;
//
//    printf("i1 = %d\n", i1);
//    printf("i2 = %d\n", i2);
//
//    char s1[] = "Hello,"
//                "world!";
//
//    printf(s1);
//
//    return 0;
//}
