//
// Created by icekylin on 2022-04-22.
//

/*
 * # 整型的类型
 *
 * - char / signed char：1 字节、-128 (-2^7) ~ 127 (2^7 -1)
 * - unsigned char：1 字节：0 ~ 255(2^8 -1)
 * - int / signed int
 *   - 2 字节：-32768 (-2^15) ~ 32768 (2^15 -1)
 *   - 4 字节：-2147483648 (-2^31) ~ 21478483647 (2^31-1)
 * - unsigned int
 *   - 2 字节：0 ~ 65535 (2^16 - 1)
 *   - 4 字节：0 ~ 4294967295 (2^32 -1)
 * - short / signed short：2 字节、-32768 (-2^15) ~ 32768 (2^15 -1)
 * - unsigned short：2 字节、0 ~ 65535 (2^16 - 1)
 * - long / signed long：4 字节、-2147483648 (-2^31) ~ 21478483647 (2^31-1)
 * - unsigned long：4 字节、0 ~ 4294967295 (2^32 -1)
 */
